{
  "judul": "Berkenalan dengan HTML",
  "penulis": ["Kucing andromeda", 8, 3, 2024],
  "genre": "teknologi",
  "url": "Berkenalan-dengan-HTML",
  "img": "Berkenalan-dengan-HTMLIMG.png",
  "isi": [
    {
      "type": "subtitle",
      "value": "Perkenalan singakat",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Pastinya kalian pernah membuka website bukan, seperti yang kalian buka sekarang.Laman dari website ini tidak akan seperti ini jika tidak ada html.Paragraf, header, link dari web ini diatur oleh html walaupun terlihat seperti coding HTML sebenarnya bukanlah Bahasa pemograman karena tidak memiliki fungsi ataupun logika yang kompleks seperti javascript, python ,java dan lain lain.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Walaupun bukanlah Bahasa pemograman HTML sekarang telah menjadi standart untuk semua website dan diatur oleh world wide web consortium(W3C) yang akan merilis perbaruan untuk HTML.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Tim Berners-Lee, seorang ahli fisika di lembaga penelitian CERN yang berlokasi di Swiss adalah tim yang menciptakan HTML ini, HTML sendiri memiliki arti Hypertext Markup Language yang merupakan Markup language yang berfungsi untuk membuat halaman website.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Versi pertama HTML ini rilis pada tahun 1991 yang memiliki 18 tag dan terus diupdate sampai sekarang, setiap updatepun juga ada penambahan tag baru serta atribut(tag modifier) yang akan ditambahkan.Dalam pengembangan dan pengelolaan HTML ini pun Berdasarkan HTML Element Reference milik Mozilla Developer Network, saat ini ada 140 tag HTML, meskipun sebagiannya sudah tidak lagi didukung oleh beberapa versi terbaru browser.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Menulis code di HTML ini sangatlah sederhana, sebagaicontoh jikalau ingin menambahkan paragraph gunakan tag <p> lalu diakhiri dengan </p> sebagai penutup tag.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "contohnya : <p> halo ini paragraph 1 </p>",
      "prop": null
    },
    {
      "type": "subtitle",
      "value": "Perbedaan HTML dengan HTML5",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Saat ini pun juga ada HTML serta HTML5, memang terdengar sama namun mereka memiliki perbedaan.HTML4 (dikenal sebagai “HTML”) dirilis pada tahun 1999 dan versi terbarunya diperkenalkan pada publik pada tahun 2014, yaitu HTML5, versi terbaru ini menambahkan lebih banyak fitur baru ke bahasa mark up ini.Jadi HTML5 adalah versi yang terbaru saat ini yang memiliki fitur yang lebih banyak seperti dukungan untuk embed audio dan video, memperkenalkan perbaruan semantic yang akan mempermudah membaca isi dari konten yang terkandung didalamnya.",
      "prop": null
    },
    {
      "type": "paragraf",
      "value": "Sekian dulu perkenalan singkatnya dengan HTML, jika terterik untuk mempelajarinya di internet sangatlah banyak bahan belajar yang dapat digunakan jadi tetaplah semangat dan Happy hacking",
      "prop": null
    }
  ]
}
